import java.util.Random;

public class Events {

    private static Random random = new Random();

    private static String[] 무기 = { //41개
            "간장",
            "막야",
            "갈라틴",
            "공포",
            "나겔링",
            "다인슬라어프",
            "담로",
            "레바테인",
            "모노호시자오",
            "아론다이트",
            "쌍룡검",
            "자웅일대검",
            "엑스칼리버",
            "청룡검",
            "칼리번",
            "헌원검",
            "롱기누스의 창",
            "방천화극",
            "청룡언월도",
            "화첨창",
            "사신의 낫",
            "반고부",
            "금전",
            "수다르사나",
            "아스트라",
            "오호",
            "타흘룸",
            "페일노트",
            "하늘의 활",
            "영광금귀신기노",
            "천근활",
            "케라우노스",
            "이오케이라",
            "안드바리나우트",
            "드라우프니르",
            "브리싱가멘",
            "백우선",
            "여의보주",
            "카두케우스",
            "영광의 손",
            "코로나 페레아"
    };

    private static String[] 방어구 = { //19개
            "카바나",
            "쿤달라",
            "핀의 유산",
            "카라카와",
            "두반",
            "아이기스",
            "앙칼라",
            "오한",
            "프리드웬",
            "저주받은 방패",
            "퀴네에",
            "힐데그림",
            "메긴기요로드",
            "야른그레이프르",
            "천사옥대",
            "녹스",
            "태양폭풍",
            "미스틸테인",
            "잠시드의 잔"
    };


    public static String set_name(String type){

        if(type == "무기"){
            return 무기[random.nextInt(40)];
        }else if(type == "방어구"){
            return 방어구[random.nextInt(18)];
        }else{
            return null;
        }
    }

}
